
if __name__ == '__main__':
    audios = ["1.爱面子.mp3","2.半边天.mp3","3.半瓶醋.mp3","5.唱主角.mp3","6.炒鱿鱼.mp3","8.后悔药.mp3","10.吃闲饭.mp3","11.出难题.mp3","12.出洋相.mp3","13.穿小鞋.mp3","14.打保票.mp3","17.打算盘.mp3","18.打退堂鼓.mp3","19.打预防针.mp3","20.打折扣.mp3","21.大锅饭.mp3","23.耳旁风.mp3","吃闭门羹\_\_【.mp3","吃老本\_\_【解.mp3","吃闲饭\_\_【解.mp3","出难题\_\_【解.mp3","出洋相\_\_【解.mp3","穿小鞋\_\_【解.mp3","打保票\_\_【解.mp3","打光棍儿\_\_【.mp3","打交道\_\_【解.mp3","打算盘\_\_［解.mp3","打退堂鼓\_\_【.mp3","打预防针\_\_【.mp3","打折扣\_\_【解.mp3","大锅饭\_\_【解.mp3","戴高帽子\_\_【.mp3","倒忙\_\_【解释.mp3","耳旁风\_\_【解.mp3","后悔药\_\_【解.mp3","1.倒胃口.mp3","2.定心丸.mp3","3.兜圈子.mp3","4.放在眼里.mp3","5.给颜色看.mp3","6.喝墨水.mp3","8.红眼病.mp3","9.夹生饭.mp3","10.见上帝.mp3","11.见世面.mp3","12.讲价钱.mp3","13.揭老底.mp3","14.开场白.mp3","15.开绿灯.mp3","16.开夜车.mp3","17.侃大山.mp3","18.拉关系.mp3","19.老大难.mp3","20.老掉牙.mp3","21.老皇历.mp3","22.两下子.mp3","23.露一手.mp3","24.马后炮.mp3","25.马拉松.mp3","26.卖关子.mp3","27.蒙在鼓里.mp3","1.磨嘴皮子.mp3","1.对不起.mp3","2.拿手戏.mp3","3.拍马屁.mp3","4.跑龙套.mp3","5.碰钉子.mp3","6.碰一鼻子灰.mp3","7.泼冷水.mp3","8.气管炎.mp3","9.敲边鼓.mp3","10.敲警钟.mp3","11.敲竹杠.mp3","12.翘尾巴.mp3","13.绕弯子.mp3","14.杀风景.mp3","15.伤脑筋.mp3","16.书呆子.mp3","17.耍嘴皮子.mp3","18.算老几.mp3","19.随大流.mp3","20.铁饭碗.mp3","21.捅娄子.mp3","22.挖墙脚.mp3","23.往上爬.mp3","24.下台阶.mp3","25.向钱看.mp3","26.小动作.mp3","27.笑掉牙.mp3","28.一刀切.mp3","29.一锅粥.mp3","30.砸饭碗.mp3","31.找窍门.mp3","32.抓把柄.mp3","33.走过场.mp3","34.走后门.mp3","35.走弯路.mp3","36.钻空子.mp3","37.钻牛角尖儿.mp3","38.做文章.mp3"]

    import os
    os.chdir("/root/mo/edu_system/upload/audio")
    for audio in audios:
        try:
            os.remove(audio)
        except Exception:
            continue